zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA365/startup_MCXA365.cpp
#define _vStackTop  __StackTop
#define _vStackBase __StackLimit

extern uint32_t __etext[];
extern uint32_t __data_start__[];
extern uint32_t __data_end__[];

extern uint32_t __bss_start__[];
extern uint32_t __bss_end__[];
#else
#error Unsupported toolchain!
#endif //(__CC_ARM) || (__ARMCC_VERSION)

//*****************************************************************************
#if defined(__cplusplus)
} // extern "C"
#endif //(__cplusplus)
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void (*const __Vectors[])(void);
#define __vector_table __Vectors
__attribute__((used, section(".isr_vector"))) void (*const __Vectors[])(void) = {
#elif defined(__MCUXPRESSO)
extern void (*const g_pfnVectors[])(void);
extern void *__Vectors __attribute__((alias("g_pfnVectors")));
#define __vector_table g_pfnVectors
__attribute__((used, section(".isr_vector"))) void (*const g_pfnVectors[])(void) = {
#elif defined(__ICCARM__)
extern void (*const __vector_table[])(void);
/* The vector table is not needed for initialization. */
extern void (*const __iar_init$$done[])(void) __attribute__((alias("__vector_table")));
__attribute__((used, section(".intvec"))) void (*const __vector_table[])(void) = {
#elif defined(__GNUC__)
extern void (*const __isr_vector[])(void);
#define __vector_table __isr_vector
__attribute__((used, section(".isr_vector"))) void (*const __isr_vector[])(void) = {
#else
#error Unsupported toolchain!
#endif //(__CC_ARM) || (__ARMCC_VERSION)
    // Core Level - CM33
    (void (*)())((uint32_t)_vStackTop), // The initial stack pointer
    Reset_Handler,                      // The reset handler

    NMI_Handler,                        // NMI Handler
    HardFault_Handler,                  // Hard Fault Handler
    MemManage_Handler,                  // MPU Fault Handler
    BusFault_Handler,                   // Bus Fault Handler
    UsageFault_Handler,                 // Usage Fault Handler
    SecureFault_Handler,                // Secure Fault Handler
    0,                                  // Reserved
    0,                                  // Reserved
    0,                                  // Reserved
    SVC_Handler,                        // SVCall Handler
    DebugMon_Handler,                   // Debug Monitor Handler
    0,                                  // Reserved
    PendSV_Handler,                     // PendSV Handler
    SysTick_Handler,                    // SysTick Handler

    // Chip Level - MCXA365
    Reserved16_IRQHandler,            // 16 : Reserved interrupt
    CMC_IRQHandler,                   // 17 : Core Mode Controller interrupt
    DMA_CH0_IRQHandler,               // 18 : DMA3_0_CH0 error or transfer complete
    DMA_CH1_IRQHandler,               // 19 : DMA3_0_CH1 error or transfer complete
    DMA_CH2_IRQHandler,               // 20 : DMA3_0_CH2 error or transfer complete
    DMA_CH3_IRQHandler,               // 21 : DMA3_0_CH3 error or transfer complete
    DMA_CH4_IRQHandler,               // 22 : DMA3_0_CH4 error or transfer complete
    DMA_CH5_IRQHandler,               // 23 : DMA3_0_CH5 error or transfer complete
    DMA_CH6_IRQHandler,               // 24 : DMA3_0_CH6 error or transfer complete
    DMA_CH7_IRQHandler,               // 25 : DMA3_0_CH7 error or transfer complete
    ERM0_SINGLE_BIT_IRQHandler,       // 26 : ERM Single Bit error interrupt
    ERM0_MULTI_BIT_IRQHandler,        // 27 : ERM Multi Bit error interrupt
    FMU0_IRQHandler,                  // 28 : Flash Management Unit interrupt
    GLIKEY0_IRQHandler,               // 29 : GLIKEY Interrupt
    MBC0_IRQHandler,                  // 30 : MBC secure violation interrupt
    SCG0_IRQHandler,                  // 31 : System Clock Generator interrupt
    SPC0_IRQHandler,                  // 32 : System Power Controller interrupt
    TDET_IRQHandler,                  // 33 : TDET interrrupt
    WUU0_IRQHandler,                  // 34 : Wake Up Unit interrupt
    CAN0_IRQHandler,                  // 35 : Controller Area Network 0 interrupt
    CAN1_IRQHandler,                  // 36 : Controller Area Network 1 interrupt
    Reserved37_IRQHandler,            // 37 : Reserved interrupt
    Reserved38_IRQHandler,            // 38 : Reserved interrupt
    FLEXIO_IRQHandler,                // 39 : Flexible Input/Output interrupt
    I3C0_IRQHandler,                  // 40 : Improved Inter Integrated Circuit interrupt 0
    Reserved41_IRQHandler,            // 41 : Reserved interrupt
    LPI2C0_IRQHandler,                // 42 : Low-Power Inter Integrated Circuit 0 interrupt
    LPI2C1_IRQHandler,                // 43 : Low-Power Inter Integrated Circuit 1 interrupt
    LPSPI0_IRQHandler,                // 44 : Low-Power Serial Peripheral Interface 0 interrupt
    LPSPI1_IRQHandler,                // 45 : Low-Power Serial Peripheral Interface 1 interrupt
    Reserved46_IRQHandler,            // 46 : Reserved interrupt
    LPUART0_IRQHandler,               // 47 : Low-Power Universal Asynchronous Receive/Transmit 0 interrupt
    LPUART1_IRQHandler,               // 48 : Low-Power Universal Asynchronous Receive/Transmit 1 interrupt
    LPUART2_IRQHandler,               // 49 : Low-Power Universal Asynchronous Receive/Transmit 2 interrupt
    LPUART3_IRQHandler,               // 50 : Low-Power Universal Asynchronous Receive/Transmit 3 interrupt
    LPUART4_IRQHandler,               // 51 : Low-Power Universal Asynchronous Receive/Transmit 4 interrupt
    USB0_IRQHandler,                  // 52 : Universal Serial Bus - Full Speed interrupt
    Reserved53_IRQHandler,            // 53 : Reserved interrupt
    CDOG0_IRQHandler,                 // 54 : Code Watchdog Timer 0 interrupt
    CTIMER0_IRQHandler,               // 55 : Standard counter/timer 0 interrupt
    CTIMER1_IRQHandler,               // 56 : Standard counter/timer 1 interrupt
    CTIMER2_IRQHandler,               // 57 : Standard counter/timer 2 interrupt
    CTIMER3_IRQHandler,               // 58 : Standard counter/timer 3 interrupt
    CTIMER4_IRQHandler,               // 59 : Standard counter/timer 4 interrupt
    FLEXPWM0_RELOAD_ERROR_IRQHandler, // 60 : FlexPWM0_reload_error interrupt
    FLEXPWM0_FAULT_IRQHandler,        // 61 : FlexPWM0_fault interrupt
    FLEXPWM0_SUBMODULE0_IRQHandler,   // 62 : FlexPWM0 Submodule 0 capture/compare/reload interrupt
    FLEXPWM0_SUBMODULE1_IRQHandler,   // 63 : FlexPWM0 Submodule 1 capture/compare/reload interrupt
    FLEXPWM0_SUBMODULE2_IRQHandler,   // 64 : FlexPWM0 Submodule 2 capture/compare/reload interrupt
    FLEXPWM0_SUBMODULE3_IRQHandler,   // 65 : FlexPWM0 Submodule 3 capture/compare/reload interrupt
    EQDC0_COMPARE_IRQHandler,         // 66 : Compare
    EQDC0_HOME_IRQHandler,            // 67 : Home
    EQDC0_WATCHDOG_IRQHandler,        // 68 : Watchdog / Simultaneous A and B Change
    EQDC0_INDEX_IRQHandler,           // 69 : Index / Roll Over / Roll Under
    FREQME0_IRQHandler,               // 70 : Frequency Measurement interrupt
    LPTMR0_IRQHandler,                // 71 : Low Power Timer 0 interrupt
    Reserved72_IRQHandler,            // 72 : Reserved interrupt
    OS_EVENT_IRQHandler,              // 73 : OS event timer interrupt
    WAKETIMER0_IRQHandler,            // 74 : Wake Timer Interrupt
    UTICK0_IRQHandler,                // 75 : Micro-Tick Timer interrupt
    WWDT0_IRQHandler,                 // 76 : Windowed Watchdog Timer 0 interrupt
    Reserved77_IRQHandler,            // 77 : Reserved interrupt
    ADC0_IRQHandler,                  // 78 : Analog-to-Digital Converter 0 interrupt
    ADC1_IRQHandler,                  // 79 : Analog-to-Digital Converter 1 interrupt
    CMP0_IRQHandler,                  // 80 : Comparator 0 interrupt
    CMP1_IRQHandler,                  // 81 : Comparator 1 interrupt
    CMP2_IRQHandler,                  // 82 : Comparator 2 interrupt
    DAC0_IRQHandler,                  // 83 : Digital-to-Analog Converter 0 - General Purpose interrupt
    Reserved84_IRQHandler,            // 84 : Reserved interrupt
    Reserved85_IRQHandler,            // 85 : Reserved interrupt
    Reserved86_IRQHandler,            // 86 : Reserved interrupt
    GPIO0_IRQHandler,                 // 87 : General Purpose Input/Output interrupt 0
    GPIO1_IRQHandler,                 // 88 : General Purpose Input/Output interrupt 1
    GPIO2_IRQHandler,                 // 89 : General Purpose Input/Output interrupt 2
    GPIO3_IRQHandler,                 // 90 : General Purpose Input/Output interrupt 3
    GPIO4_IRQHandler,                 // 91 : General Purpose Input/Output interrupt 4
    Reserved92_IRQHandler,            // 92 : Reserved interrupt
    LPI2C2_IRQHandler,                // 93 : Low-Power Inter Integrated Circuit 2 interrupt
    LPI2C3_IRQHandler,                // 94 : Low-Power Inter Integrated Circuit 3 interrupt
    FLEXPWM1_RELOAD_ERROR_IRQHandler, // 95 : FlexPWM1_reload_error interrupt
    FLEXPWM1_FAULT_IRQHandler,        // 96 : FlexPWM1_fault interrupt
    FLEXPWM1_SUBMODULE0_IRQHandler,   // 97 : FlexPWM1 Submodule 0 capture/compare/reload interrupt
    FLEXPWM1_SUBMODULE1_IRQHandler,   // 98 : FlexPWM1 Submodule 1 capture/compare/reload interrupt
    FLEXPWM1_SUBMODULE2_IRQHandler,   // 99 : FlexPWM1 Submodule 2 capture/compare/reload interrupt
    FLEXPWM1_SUBMODULE3_IRQHandler,   // 100: FlexPWM1 Submodule 3 capture/compare/reload interrupt
    EQDC1_COMPARE_IRQHandler,         // 101: Compare
    EQDC1_HOME_IRQHandler,            // 102: Home
    EQDC1_WATCHDOG_IRQHandler,        // 103: Watchdog / Simultaneous A and B Change
    EQDC1_INDEX_IRQHandler,           // 104: Index / Roll Over / Roll Under
    Reserved105_IRQHandler,           // 105: Reserved interrupt
    Reserved106_IRQHandler,           // 106: Reserved interrupt
    Reserved107_IRQHandler,           // 107: Reserved interrupt
    Reserved108_IRQHandler,           // 108: Reserved interrupt
    Reserved109_IRQHandler,           // 109: Reserved interrupt
    Reserved110_IRQHandler,           // 110: Reserved interrupt
    LPUART5_IRQHandler,               // 111: Low-Power Universal Asynchronous Receive/Transmit interrupt
    Reserved112_IRQHandler,           // 112: Reserved interrupt
    Reserved113_IRQHandler,           // 113: Reserved interrupt
    Reserved114_IRQHandler,           // 114: Reserved interrupt
    Reserved115_IRQHandler,           // 115: Reserved interrupt
    Reserved116_IRQHandler,           // 116: Reserved interrupt
    Reserved117_IRQHandler,           // 117: Reserved interrupt
    Reserved118_IRQHandler,           // 118: Reserved interrupt
    Reserved119_IRQHandler,           // 119: Reserved interrupt
    Reserved120_IRQHandler,           // 120: Reserved interrupt
    Reserved121_IRQHandler,           // 121: Reserved interrupt
    Reserved122_IRQHandler,           // 122: Reserved interrupt
    MAU_IRQHandler,                   // 123: MAU interrupt
    SMARTDMA_IRQHandler,              // 124: SmartDMA interrupt
    CDOG1_IRQHandler,                 // 125: Code Watchdog Timer 1 interrupt
    PKC_IRQHandler,                   // 126: PKC interrupt
    SGI_IRQHandler,                   // 127: SGI interrupt
    Reserved128_IRQHandler,           // 128: Reserved interrupt
    TRNG0_IRQHandler,                 // 129: True Random Number Generator interrupt
    SECURE_ERR_IRQHandler,            // 130: Secure IP Error interrupt. It OR SGI, PKC, TRNG error together.
    Reserved131_IRQHandler,           // 131: Reserved interrupt
    ADC2_IRQHandler,                  // 132: Analog-to-Digital Converter 2 interrupt
    ADC3_IRQHandler,                  // 133: Analog-to-Digital Converter 3 interrupt
    Reserved134_IRQHandler,           // 134: Reserved interrupt
    RTC_IRQHandler,                   // 135: RTC alarm interrupt
    RTC_1HZ_IRQHandler,               // 136: RTC 1Hz interrupt
    LCD_IRQHandler,                   // 137: SLCD frame start interrupt
};                                     /* End of __vector_table */

#if defined(__MCUXPRESSO)
#if defined(ENABLE_RAM_VECTOR_TABLE)
extern void *__VECTOR_TABLE __attribute__((alias("g_pfnVectors")));
void (*__VECTOR_RAM[sizeof(g_pfnVectors) / 4])(void) __attribute__((aligned(128)));
unsigned int __RAM_VECTOR_TABLE_SIZE_BYTES = sizeof(g_pfnVectors);
#endif //(ENABLE_RAM_VECTOR_TABLE)

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__((section(".after_vectors.init_data"))) void data_init(unsigned int romstart,
                                                                    unsigned int start,
                                                                    unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int *pulSrc  = (unsigned int *)romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__((section(".after_vectors.init_bss"))) void bss_init(unsigned int start, unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;
#endif //(__MCUXPRESSO)

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
__attribute__ ((used, section("InRoot$$Sections")))
__attribute__ ((naked))
#elif defined(__MCUXPRESSO)
__attribute__ ((naked, section(".after_vectors.reset")))
#elif defined(__ICCARM__)
__stackless
#elif defined(__GNUC__)
__attribute__ ((naked))
#endif //(__CC_ARM) || (__ARMCC_VERSION)
void Reset_Handler(void)
{
    // Disable interrupts
    __asm volatile("cpsid i");
    // Config VTOR & MSP register
    __asm volatile(
        "LDR R0, =0xE000ED08  \n"
        "STR %0, [R0]         \n"
        "LDR R1, [%0]         \n"
        "MSR MSP, R1          \n"
        "MSR MSPLIM, %1       \n"
        :
        : "r"(__vector_table), "r"(_vStackBase)
        : "r0", "r1");

